{
    "csharp":"Skilled in C#, I have focused primarily on native application development, leveraging the Edge WebView2 library to create robust and responsive applications. My experience includes implementing various features and functionalities using C# to deliver high-quality, user-friendly applications.",
    "react":"With over 4 years of experience in React, I have developed a deep understanding of the framework's ins and outs. I have worked on a variety of projects, ranging from small-scale applications to large, complex systems. My experience includes implementing efficient UI components, managing state effectively, and integrating with backend services. I am proficient in using React's ecosystem, including Redux for state management, React Router for navigation, and other popular libraries and tools.",
    "sass": "In CSS, I specialize in crafting visually appealing and responsive user interfaces for web applications. I have experience with CSS preprocessors like SASS  to improve code maintainability and reusability. I am adept at CSS layout techniques such as Flexbox and Grid, enabling me to create complex layouts with ease.",
    "graphql":"Proficient in GraphQL, I have hands-on experience working with queries and subscriptions, ensuring efficient data retrieval and real-time updates. I am familiar with Hasura GraphQL and have worked extensively with it, gaining knowledge in managing roles and permissions to ensure secure data access.",
    "webpack": "In Webpack, I specialize in configuring and optimizing build processes for web applications, with a focus on module federation and code splitting. My expertise includes setting up entry points, loaders, and plugins to manage assets and dependencies efficiently. I have experience in creating production-ready bundles that are optimized for performance and loading speed, leveraging module federation for dynamic module loading and code splitting to improve application performance. I am proficient in using Webpack to handle various file types, such as JavaScript, CSS, and images, and to bundle them into a single output. Additionally, I stay updated with the latest features and best practices in Webpack to ensure smooth and effective build processes for projects of all sizes.",
    "redux": "In Redux, I specialize in managing application state and data flow efficiently. I am proficient in using Redux for code splitting, allowing for better organization and optimization of code bundles. Additionally, I have experience in implementing middleware and asynchronous actions with Redux, enhancing the application's ability to manage side effects",
    "nodejs": "I have experience in using Express.js to create robust web servers and middleware for request processing. Furthermore, I have experience with Rollup and TDX for building custom packages, allowing for optimized and streamlined development workflows.",
    "nginx": "My expertise  includes handling routing and managing nginx configurations for optimal performance of platform.",
    "twilio": "Using Twilio, I specialize in leveraging Twilio Chat and Video features to enhance real-time communication in applications. My expertise includes setting up and configuring chat rooms and video rooms to enable seamless collaboration and communication among users. Also have experience in building presence system for users using twilio sync",
    "redis": " I specialize in using Redis with various server technologies to enhance application performance and scalability. My experience includes integrating Redis with Express.js, Python, and Spring Boot servers to improve caching and data management. I am proficient in setting up Redis clusters and using Redis commands to store and retrieve data efficiently.",
    "spring": "In Spring Boot, I specialize in developing RESTful microservices to build scalable and efficient applications. My experience includes using Spring Boot's features such as auto-configuration, embedded servers, and production-ready metrics to quickly build and deploy microservices. I am proficient in using Spring Data to interact with databases and Spring Security to implement authentication and authorization mechanisms. Additionally, I have experience in using Spring Boot Actuator to monitor and manage application health.",
    "java": "Coming Soon! 😉",
    "python": "Well experienced in python scripting, worked with various python libraries for data analysis." ,
    "flask": "Proficient in building flask server includes designing RESTful APIs, implementing authentication and authorization mechanisms.",
    "sql": "In PostgreSQL, I have experience in creating tables, defining data types, and writing functions to manipulate data or create views. My experience includes designing database schemas, setting up indexes for performance optimization, and writing complex queries. I am proficient in using PostgreSQL's features such as triggers, user-defined functions. Additionally, I have experience in working with PostgreSQL's advanced features like JSONB data type for storing and querying JSON data."
}